10/data/attachments/1e2d88a383de5571.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7444482f-8ed0-41ff-ad95-d03ed854b623</nif:username>
            <nif:friendToBeAdded>Paul_attack_Friend_77012_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>